## Tarea 2
Juan Pablo Fernandez Delgado 
Aprendizaje Automatico

Guía para la utilización de las librerías de Pandas, pandas es una de las librerías más populares de Python para la ciencia de datos y análisis.

Primero se instala los paquetes de pandas.
#conda install pandas
#pip install pandas

Se importan las librerías numpy y pandas para la utilización y manipulación de los datasets que se desean cargar.

In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

### Temas importantes para la utilización de pandas
    Series
    DataFrames
    Missing Data
    GroupBy
    Merging,Joing and Concatenating
    Operation
    Datos de entrada y salida

### Series
El primer tipo de datos principal sobre el que aprenderemos para pandas es el tipo de datos de la serie. 
Importemos Pandas y exploremos el objeto Series.
Se puede utilizar el ordenamiento de listas e indexarlas de una manera ordenada

In [ ]:
# Creamos una serie
# Vamos a convertir una lista, un numpy array o un diccionario a una Serie

In [4]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [6]:
# Usando Listas
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
# Usando Numpy Array
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [10]:
# Usando un diccionario
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [ ]:
Usando índices
La clave para usar una serie es entender su índice.

In [14]:
ser1 = pd.Series([1,2,3,4],index = ['USA','GERMANY','USSR','CHINA'])

In [15]:
ser1

USA        1
GERMANY    2
USSR       3
CHINA      4
dtype: int64

In [10]:
ser1[3]

4

### DataFrames
Los DataFrames es el marco principal de pandas y están directamente inspirados en el lenguaje de programación R
ejemplo: generamos datos aleatorios

In [11]:
np.random.seed(101)

In [79]:
# Armamos el dataframe
df = pd.DataFrame(randn(5,4),index= ['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [80]:
df

          W         X         Y         Z
A  0.470431  0.821078  0.639424  0.224483
B -0.531357 -0.060893  0.016638  0.875730
C -1.596713 -1.436451  1.166501  2.181996
D  0.525499 -0.692627 -1.791879 -2.133111
E -1.458494 -2.267307  0.060225  0.235946

In [81]:
# Mostramos solo la columna W y la X
df[['W','X']]

          W         X
A  0.470431  0.821078
B -0.531357 -0.060893
C -1.596713 -1.436451
D  0.525499 -0.692627
E -1.458494 -2.267307

In [85]:
# Agregamos una nueva columna nombrada new y es la suma de las columnas W y Y.
df['new'] = df['W'] + df['Y']

In [86]:
df

          W         X         Y         Z       new
A  0.470431  0.821078  0.639424  0.224483  1.109855
B -0.531357 -0.060893  0.016638  0.875730 -0.514719
C -1.596713 -1.436451  1.166501  2.181996 -0.430212
D  0.525499 -0.692627 -1.791879 -2.133111 -1.266380
E -1.458494 -2.267307  0.060225  0.235946 -1.398269

In [87]:
# Eliminamos la columna agregada 'new'
df.drop('new',axis=1,inplace=True)

In [89]:
df

          W         X         Y         Z
A  0.470431  0.821078  0.639424  0.224483
B -0.531357 -0.060893  0.016638  0.875730
C -1.596713 -1.436451  1.166501  2.181996
D  0.525499 -0.692627 -1.791879 -2.133111
E -1.458494 -2.267307  0.060225  0.235946

In [90]:
# Eliminamos la fila E
df.drop('E',axis=0)

          W         X         Y         Z
A  0.470431  0.821078  0.639424  0.224483
B -0.531357 -0.060893  0.016638  0.875730
C -1.596713 -1.436451  1.166501  2.181996
D  0.525499 -0.692627 -1.791879 -2.133111

In [91]:
# La función shape muestra la cantidad de columnas y filas que tenemos en nuestro dataframe
df.shape

(5, 4)

In [92]:
# Seleccionar columnas para el dataframe
# loc: busca por el nombre de la columna
# iloc: busca por el numero de la columna
df.loc['A']

W    0.470431
X    0.821078
Y    0.639424
Z    0.224483
Name: A, dtype: float64

In [93]:
df.iloc[0]

W    0.470431
X    0.821078
Y    0.639424
Z    0.224483
Name: A, dtype: float64

In [94]:
df.loc['B','Y']

0.016637624217753676

In [95]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.470431  0.639424
B -0.531357  0.016638

Selecciones condicionales (hacemos búsquedas booleanas)

In [96]:
# Mostramos las datos condicionales, los que son mayores que 0, 
# Los valores verdaderos se muestra y los falsos los muestra como Nulos or Nan
booldf = df > 0

In [98]:
df[booldf]

          W         X         Y         Z
A  0.470431  0.821078  0.639424  0.224483
B       NaN       NaN  0.016638  0.875730
C       NaN       NaN  1.166501  2.181996
D  0.525499       NaN       NaN       NaN
E       NaN       NaN  0.060225  0.235946

In [99]:
df[df>0]

          W         X         Y         Z
A  0.470431  0.821078  0.639424  0.224483
B       NaN       NaN  0.016638  0.875730
C       NaN       NaN  1.166501  2.181996
D  0.525499       NaN       NaN       NaN
E       NaN       NaN  0.060225  0.235946

In [100]:
# Muestra la columna W con datos booleanos
df['W']>0

A     True
B    False
C    False
D     True
E    False
Name: W, dtype: bool

In [101]:
df[df['W']>0]

          W         X         Y         Z
A  0.470431  0.821078  0.639424  0.224483
D  0.525499 -0.692627 -1.791879 -2.133111

In [102]:
resultdf = df[df['W']>0]

In [103]:
resultdf['X']

A    0.821078
D   -0.692627
Name: X, dtype: float64

In [104]:
# Selección múltiple
df[df['W']>0][['X','Y']]

          X         Y
A  0.821078  0.639424
D -0.692627 -1.791879

In [105]:
# Selección múltiple
boolser = df['W'] > 0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.639424  0.821078
D -1.791879 -0.692627

In [55]:
#Se usa selección múltiple condicionales
df[(df['W']>0) & (df['Y']> 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [56]:
# Se usa condiciones múltiples
df[(df['W']>0) | (df['Y']> 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
# Función para reiniciar el índice
df
df.reset_index()

  index         W         X         Y         Z State
0     A  2.706850  0.628133  0.907969  0.503826    CA
1     B  0.651118 -0.319318 -0.848077  0.605965    NY
2     C -2.018168  0.740122  0.528813 -0.589001    WY
3     D  0.188695 -0.758872 -0.933237  0.955057    OR
4     E  0.190794  1.978757  2.605967  0.683509    CO

In [69]:
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [60]:
# Agregamos lista de estados en un string y lo cortamos por los espacios
newind = 'CA NY WY OR CO'.split()

In [61]:
# Se muestra la lista de 'State'
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [70]:
# Agregamos una nueva lista al dataset que se llama State
df['State'] = newind

In [71]:
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [72]:
# Agregamos la columna State como índice
df.set_index('State')

              W         X         Y         Z
State
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

Multi Index y index key

In [73]:
# Index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [74]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [75]:
# Construimos un dataset multiniveles
dg = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [77]:
dg

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [81]:
dg.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [84]:
# Asignamos nombres a los índices
dg.index.names = ['Groups','Num']

In [85]:
dg

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [88]:
# Seleccionamos un dato en especifico
dg.loc['G2'].loc[2]['B']

0.07295967531703869

In [92]:
# Mostramos solo el grupo de G1
dg.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [93]:
dg.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

### Missing Data
Veamos algunos métodos para los valores vacíos o nan.

In [19]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [20]:
dd = pd.DataFrame(d)

In [21]:
dd

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [98]:
dd.dropna(axis=1)

   C
0  1
1  2
2  3

In [99]:
dd.dropna()

     A    B  C
0  1.0  5.0  1

In [22]:
dd.dropna(axis=1)

   C
0  1
1  2
2  3

In [26]:
dd.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [104]:
# Llenamos los valores nulos con un valor
dd.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [27]:
# llenamos el valor nulo de la columna A con la media
dd['A'].fillna(value=dd['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Group By
El group by permite el agrupamiento de filas.

In [106]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [107]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [108]:
gg = pd.DataFrame(data)

In [109]:
gg

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [111]:
# Agrupamos por la columna company
byComp = gg.groupby('Company')

In [113]:
# Agrupamos por la media
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [114]:
# Agrupamos por suma
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [115]:
# Agrupamos por desviación standar
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [116]:
# Agrupamos por suma las Compañías FB
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [118]:
# Agrupamos por cantidades
gg.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [119]:
# Agrupamos por Máximos
gg.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [120]:
# Agrupamos por Mínimos
gg.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [124]:
# Agrupación por todos los detalles de TODO el dataset
gg.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [125]:
# Agrupación por todos los detalles del dataset de una compañía
gg.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### Mergin, joining and concatening
Hay tres formas de combinar dataset juntas son: Merging, Joining y Concatening.

In [28]:
# Ejemplo de 3 datasets
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [31]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [32]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [33]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

##### Concatenacion

In [34]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [35]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

##### Merging

In [36]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [37]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [38]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [39]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [40]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

##### Joining

In [41]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [42]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [43]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Operations
Vamos a mostrar algunas operaciones de pandas que son muy utiles, vamos a mostrar algunas.

In [45]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [46]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [47]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [48]:
df['col2'].nunique()

3

In [49]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [51]:
# Seleccionamos del dataset usando un criterio de múltiples columnas
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [53]:
newdf

   col1  col2 col3
3     4   444  xyz

In [54]:
# Usando funciones
def times2(x):
    return x*2

In [55]:
# retorna el valor multiplicado por 2
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [56]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [57]:
df['col1'].sum()

10

In [58]:
del df['col1']

In [59]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [60]:
# Nombres de columnas
df.columns

Index(['col2', 'col3'], dtype='object')

In [61]:
# Índice
df.index

RangeIndex(start=0, stop=4, step=1)

In [63]:
# Ordenamiento por columna col2
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [64]:
# Buscamos Nulos
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [65]:
# Eliminamos nulos
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [66]:
# Llenamos los nulos con el dato FILL
df.fillna('FILL')

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

##### Tablas Pivotes

In [67]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [68]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Datos de intrada y Salida

In [69]:
#CSV de entrada o lectura
# input
df = pd.read_csv('https://raw.githubusercontent.com/jpablofdez/DataScience/master/Tareas/tarea2/example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [71]:
#CSV de Salida
df.to_csv('example',index=False)

In [76]:
# Excel de entrada, para la lectura del archivo excel hay que cargarlo en la fuente.
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

C:\Program Files (x86)\Microsoft Visual Studio\Shared\Anaconda3_64\lib\site-packages\pandas\io\excel.py:329: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  **kwds)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [77]:
# Excel de Salida
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

Fin..
Se deja un link para más detalle de la instalación de pandas y sus fuentes.
Instalación:
https://pandas.pydata.org/pandas-docs/stable/install.html